In [1]:
import numpy as np
import pandas  as pd
from pandas import Series,DataFrame

In [3]:
ser1=Series(np.arange(4),index=['a','b','c','d'])
ser1

a    0
b    1
c    2
d    3
dtype: int32

In [4]:
ser1.drop('b')

a    0
c    2
d    3
dtype: int32

In [5]:
ser1

a    0
b    1
c    2
d    3
dtype: int32

In [6]:
ser2=ser1.drop('c')
ser2

a    0
b    1
d    3
dtype: int32

In [7]:
df=DataFrame(np.arange(9).reshape((3,3)),index=['delhi','mumbai','jaipur'],columns=['pop','area','year'])
df

        pop  area  year
delhi     0     1     2
mumbai    3     4     5
jaipur    6     7     8

In [9]:
df.drop('mumbai')

        pop  area  year
delhi     0     1     2
jaipur    6     7     8

In [10]:
df

        pop  area  year
delhi     0     1     2
mumbai    3     4     5
jaipur    6     7     8

In [11]:
df2=df.drop('mumbai')
df2

        pop  area  year
delhi     0     1     2
jaipur    6     7     8

In [15]:
df.drop('year',axis=1)

        pop  area
delhi     0     1
mumbai    3     4
jaipur    6     7

In [16]:
df.drop('mumbai',axis=0)

        pop  area  year
delhi     0     1     2
jaipur    6     7     8